#!/usr/env/bin bash

# Скрипт для сбора информации об системе. Расчитан на использование против линукс систем.
# 	Скрипт собирает следующую информацию:
# 1. Информация об системе: ядро, архитектура, запущенные процессы
# 2. Информация о сети: сетевый интерфейсы, развернутые службы, открытые порты
# 3. Пользователи и группы: история действий, права и файлы пользователей, ключи и пароли
# 4. Доступное ПО: полезное для пивотинга и эскалации привелегий программное обеспечение
# 5. Файлы и резервные копии: файлы, содержащие полезную информацию, резервные копии недоступных для чтениы файлов
# 6.
# 7.
# 8.
# 9.
# 10.Доступные уязвимости: уязвимости, которые могут помочь повысить привелегии

